app/views/tasks/edit.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."event_id" = $1  [["event_id", 1]]
---
<br>
<%= f.select :location_id, @task.event.locations.collect { |location| [location.name, location.id] }, {label: "End Location", label_class: "feed"}, {class: "my-form-field ph"}  %>