app/views/tasks/new.html.erb

SELECT "locations".* FROM "locations" WHERE "locations"."event_id" = $1  [["event_id", 1]]
---
  <%= f.label :location_id, "End Location" %>
  <%= f.select :location_id, @event.locations.collect { |location| [location.name, location.id] } %>