app/views/events/index.html.erb

      <ol>
      <% event.locations.reverse.each do |location| %></p>
---
SELECT "locations".* FROM "locations" WHERE "locations"."event_id" = $1  [["event_id", 1]]