app/views/events/show.html.erb

SELECT "locations".* FROM "locations" WHERE "locations"."event_id" = $1  [["event_id", 7]]
---
  <ol>
    <% @event.locations.each do |location| %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = $1  [["event_id", 6]]
---
<h3>Tasks:</h3>
<% @event.tasks.each do |task| %>