app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    if @event.save
      flash[:success] = "you done created it~"
      redirect_to event_path(@event)
    else
      flash[:error] = "nerp!"
      render :new
    end

    if !params[:event][:locations].nil?
      params[:event][:locations]["locations"].split(", ").each do |location|
        Location.create(name: location, event_id: @event.id)
---
INSERT INTO "events" ("title", "address", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "locations" ("name", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dog"], ["event_id", 7], ["created_at", "2017-05-31 15:35:49.015601"], ["updated_at", "2017-05-31 15:35:49.015601"]]

  def find_event
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]