app/controllers/sessions_controller.rb

  def create
    if @user = User.find_by(email: params[:email]) || @user.authenticate(params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "terrance@taskr.com"], ["LIMIT", 1]]