app/controllers/tasks_controller.rb

  def new
    @task = Task.new
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["event_id", 6], ["created_at", "2017-05-31 18:00:45.080624"], ["updated_at", "2017-05-31 18:00:45.080624"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "description" = $1, "priority" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "Clean the bathroom because humans are nasty!"], ["priority", 5], ["updated_at", "2017-06-01 02:29:35.997778"], ["id", 1]]

  def add_task
    @task.update(user: current_user, status: "in progress")
---
UPDATE "tasks" SET "user_id" = $1, "status" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["user_id", 1], ["status", "in progress"], ["updated_at", "2017-06-01 15:49:28.545260"], ["id", 4]]

  def remove_task
    @task.update(user: nil, status: "open")
---
UPDATE "tasks" SET "user_id" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["user_id", nil], ["updated_at", "2017-06-01 15:56:48.906790"], ["id", 1]]

  def find_task
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]