app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "manager", "password_digest", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @user.delete
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]